{
  "displayName": "nomifactory-ja-preview",
  "description": "Provides rich preview for Nomifactory JA Lang.",
  "nomifactory-ja-preview.preview.breaks.desc": "Sets how line-breaks are rendered in the Nomifactory JA Lang preview. Setting it to 'true' creates a <br> for newlines inside paragraphs.",
  "nomifactory-ja-preview.preview.linkify": "Convert URL-like text to links in the Nomifactory JA Lang preview.",
  "nomifactory-ja-preview.preview.typographer": "Enable some language-neutral replacement and quotes beautification in the Nomifactory JA Lang preview.",
  "nomifactory-ja-preview.preview.doubleClickToSwitchToEditor.desc": "Double click in the Nomifactory JA Lang preview to switch to the editor.",
  "nomifactory-ja-preview.preview.fontFamily.desc": "Controls the font family used in the Nomifactory JA Lang preview.",
  "nomifactory-ja-preview.preview.fontSize.desc": "Controls the font size in pixels used in the Nomifactory JA Lang preview.",
  "nomifactory-ja-preview.preview.lineHeight.desc": "Controls the line height used in the Nomifactory JA Lang preview. This number is relative to the font size.",
  "nomifactory-ja-preview.preview.markEditorSelection.desc": "Mark the current editor selection in the Nomifactory JA Lang preview.",
  "nomifactory-ja-preview.preview.scrollEditorWithPreview.desc": "When a Nomifactory JA Lang preview is scrolled, update the view of the editor.",
  "nomifactory-ja-preview.preview.scrollPreviewWithEditor.desc": "When a Nomifactory JA Lang editor is scrolled, update the view of the preview.",
  "nomifactory-ja-preview.preview.title": "Open Preview",
  "nomifactory-ja-preview.previewSide.title": "Open Preview to the Side",
  "nomifactory-ja-preview.showLockedPreviewToSide.title": "Open Locked Preview to the Side",
  "nomifactory-ja-preview.showSource.title": "Show Source",
  "nomifactory-ja-preview.styles.dec": "A list of URLs or local paths to CSS style sheets to use from the Nomifactory JA Lang preview. Relative paths are interpreted relative to the folder open in the Explorer. If there is no open folder, they are interpreted relative to the location of the Nomifactory JA Lang file. All '\\' need to be written as '\\\\'.",
  "nomifactory-ja-preview.trace.extension.desc": "Enable debug logging for the Nomifactory JA Lang extension.",
  "nomifactory-ja-preview.trace.server.desc": "Traces the communication between VS Code and the Nomifactory JA Lang language server.",
  "nomifactory-ja-preview.preview.refresh.title": "Refresh Preview",
  "nomifactory-ja-preview.preview.toggleLock.title": "Toggle Preview Locking",
  "workspaceTrust": "Required for loading styles configured in the workspace."
}
